//-----------------------------------------------------------
// SettingManager.cpp
// 設定画面の管理
// 制作日 2015.04.10
// 制作者 motumotu
//-----------------------------------------------------------
#include "SettingManager.h"

//-----------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------
SettingManager::SettingManager(GameData* data, GameState* state)
{
    game_data = data;
    game_state = state;
    input_state = state->getInputState();
}

//-----------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------
SettingManager::~SettingManager()
{

}
//-----------------------------------------------------------
// 初期処理
//-----------------------------------------------------------
void SettingManager::init()
{

}

//-----------------------------------------------------------
// 更新処理
//-----------------------------------------------------------
void SettingManager::update()
{
    //---- クリック処理
    // 左クリックされた瞬間
    if (input_state->getClick(MOUSE_INPUT_LEFT) == 1) {
        game_state->getSceneState()->changePreScene();
    }
}